
&НаСервере
Процедура АвтоматичесокеЗаполнениеНаСервере() 
	Объект.Начисления.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Период не заполнен!");
		СообщениеПользователю.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеСотрудников.Период КАК ПериодОклада,
	|	ДанныеСотрудников.Оклад КАК Оклад,
	|	ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеСотрудников.Работает КАК Работает
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК ДанныеСотрудников
	|ГДЕ
	|	(ДанныеСотрудников.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|			ИЛИ ДанныеСотрудников.Период В
	|				(ВЫБРАТЬ
	|					ДанныеСотрудниковСрезПоследних.Период
	|				ИЗ
	|					РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаКонца, ) КАК ДанныеСотрудниковСрезПоследних)
	|			ИЛИ ДанныеСотрудников.Период В
	|				(ВЫБРАТЬ
	|					ДанныеСотрудниковСрезПоследних.Период
	|				ИЗ
	|					РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаНачала, ) КАК ДанныеСотрудниковСрезПоследних))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеСотрудников.Сотрудник.Наименование,
	|	ПериодОклада УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Оклад)
	|ПО
	|	Сотрудник"; 
	
	КонецПериода = КонецМесяца(Объект.ПериодНачисления);
	НачалоПериода = НачалоМесяца(Объект.ПериодНачисления); 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКонца", КонецПериода);
	
	ВыборкаИтоги =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ПредыдущаяЗаписьДата = Неопределено;  
		
		ВыборкаДетальные = ВыборкаИтоги.Выбрать(); 
		
		Пока ВыборкаДетальные.Следующий() Цикл
			
			Если НЕ ВыборкаДетальные.Работает Тогда 
				ПредыдущаяЗаписьДата = ВыборкаДетальные.ПериодОклада;
				Продолжить;
			Иначе
				
				СтрокаТЧ = Объект.Начисления.Добавить();
				
				СтрокаТЧ.Сотрудник = ВыборкаДетальные.Сотрудник;
				СтрокаТЧ.ГрафикРаботы = ВыборкаДетальные.ГрафикРаботы;
				СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
				СтрокаТЧ.ПоказательРасчета = ВыборкаДетальные.Оклад; 
				СтрокаТЧ.ДатаНачала = Макс(ВыборкаДетальные.ПериодОклада, НачалоПериода);
				
				Если ПредыдущаяЗаписьДата = Неопределено Тогда
					СтрокаТЧ.ДатаОкончания = КонецПериода;
				Иначе 
					СтрокаТЧ.ДатаОкончания = ПредыдущаяЗаписьДата - 1 ;
				КонецЕсли;
				
				ПредыдущаяЗаписьДата = ВыборкаДетальные.ПериодОклада;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматичесокеЗаполнение(Команда)
	АвтоматичесокеЗаполнениеНаСервере();
КонецПроцедуры

