
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииТипаКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТипаКонтрагента()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагента.Клиент") Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента"; 
		Элементы.ОсновнойДоговор.Видимость = Ложь;   
		Элементы.Питомцы.Видимость = Истина; 
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
        Элементы.Пол.Видимость = Истина; 
		Элементы.ОткудаУзналиОНас.Видимость = Истина;		
	Иначе
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.ОткудаУзналиОНас.Видимость = Ложь;
        
	КонецЕсли
	
	КонецПроцедуры

&НаКлиенте
	Процедура ТипКонтрагентаПриИзменении(Элемент)
		ПриИзмененииТипаКонтрагента();
	КонецПроцедуры
