
Процедура РегистрацияНеПодтвержденаОбработка(ТочкаМаршрутаБизнесПроцесса)
	ОбъектПользователь = Пользователь.ПолучитьОбъект();	
	ОбъектПользователь.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииКлиентаПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	БизнесПроцесс = Задача.БизнесПроцесс;
	БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
	
	Если Задача.ПолученоСогласие  Тогда		
		БизнесПроцессОбъект.РегистрацияПодтверждена = Истина;
		БизнесПроцессОбъект.Записать(); 
	Иначе
		БизнесПроцессОбъект.РегистрацияПодтверждена = Ложь;
		БизнесПроцессОбъект.Записать();
	КонецЕсли; 
	БизнесПроцессОбъект.ВедущаяЗадача = Задача.Ссылка;
	БизнесПроцессОбъект.Записать();  
	
КонецПроцедуры

Процедура ПодтверждениеРегистрацииПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Наименование  = "Получить согласие клиента " + Пользователь.Наименование + " на регистрацию"; 
		ФормируемаяЗадача.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя." + Символы.ПС +
		"Необходимо созвониться с клиентом " + Пользователь.Наименование + "по	телефону: " + Пользователь.Телефон + 
		" и получить согласие на регистрацию, а также дозаполнить карточку клиента - ФИО, Дату Рождения, сведения о питомцах и другие данные, которые клиент согласен предоставить.";
		ФормируемаяЗадача.Предмет = Пользователь;	
	КонецЦикла;

КонецПроцедуры


