
&НаСервере
Процедура АвтоматичесокеЗаполнениеНаСервере()
	Объект.Начисления.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Период не заполнен!");
		СообщениеПользователю.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Сотрудник КАК Сотрудник,
	|	СУММА(Продажи.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Продажи.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Сотрудник"; 
	
	КонецПериода = КонецМесяца(Объект.ПериодНачисления);
	НачалоПериода = НачалоМесяца(Объект.ПериодНачисления); 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЧ = Объект.Начисления.Добавить();
		
		СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
		СтрокаТЧ.ВидРасчета = ПланыВИдовРасчета.Начисления.НайтиПоКоду("ППОП");
		СтрокаТЧ.ПоказательРасчета = Выборка.Сумма; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматичесокеЗаполнение(Команда)
	АвтоматичесокеЗаполнениеНаСервере();
КонецПроцедуры
