
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменениеТипаДоговораНаБессрочный(); 
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ФормированиеНаименованиеДоговора();
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеТипаДоговораНаБессрочный()
	Если Объект.ПризнакБессрочный Тогда
		  Элементы.ДатаОкончанияДоговора.Видимость = Ложь;
		  
		  Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
			  Объект.ДатаОкончанияДоговора = "0001,01,01";
		  КонецЕсли;
	Иначе
				
		Элементы.ДатаОкончанияДоговора.Видимость = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакБессрочныйПриИзменении(Элемент)
	ИзменениеТипаДоговораНаБессрочный();
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора + " от " + Формат(Объект.ДатаЗаключенияДоговора,"ДЛФ=Д");
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора;  
	Иначе Объект.Наименование = " от " + Объект.ДатаЗаключенияДоговора;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	ФормированиеНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	ФормированиеНаименованиеДоговора();
КонецПроцедуры
