
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика; 
	
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).УчетнаяПолитика;	
	Движения.ТоварыНаСкладах.Записывать = Истина; 
	Если СтруктураУчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней 	
		И СтруктураУчетнаяПолитика <> ПредыдущаяПолитика() Тогда 
		Блокировка = Новый БлокировкаДанных; 
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос; 
		Запрос.Текст =
		"ВЫБРАТЬ
		|    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|    ТоварыНаСкладахОстатки.Склад КАК Склад,
		|    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|    ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|    ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			
			Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка,,"СрокГодности");
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
	
Функция ПредыдущаяПолитика() 
	ЗапросПолитики = Новый Запрос;
	ЗапросПолитики.Текст =
	" ВЫБРАТЬ ПЕРВЫЕ 2
    |		РегистрСведенийУчетнаяПолитика.Период КАК Период,
    |		РегистрСведенийУчетнаяПолитика.УчетнаяПолитика КАК УчетнаяПолитика 
   	|		ИЗ РегистрСведений.УчетнаяПолитика КАК РегистрСведенийУчетнаяПолитика
   	|		УПОРЯДОЧИТЬ ПО
   	|		Период УБЫВ"; 
	ЗапросПолитики.Выполнить().Выбрать().Следующий();
	Возврат УчетнаяПолитика 
КонецФункции	