Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)

Если ИменаПараметровСеанса <> Неопределено Тогда
     УстановленныеПараметры = Новый Массив;
    Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
        УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
    КонецЦикла;
КонецЕсли;

КонецПроцедуры
Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)

Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда

    Возврат;

КонецЕсли;

Если ИмяПараметра = "ТекущийПользователь" Тогда //(1)

    ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь(); //(2)

    Если ПользовательИБ = Неопределено Тогда

        возврат;

    КонецЕсли;

    ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ПользовательИБ.УникальныйИдентификатор); //(3)

    Если ТекущийПользователь.Пустая() Тогда //(4)

        ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент(); //(5)

        ПользовательОбъект.Код = ПользовательИБ.УникальныйИдентификатор;

        ПользовательОбъект.Наименование = ПользовательИБ.Имя;

        ПользовательОбъект.Записать();  //(6)

        ТекущийПользователь = ПользовательОбъект.Ссылка; //(7)

    КонецЕсли;

    ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь; //(8)

КонецЕсли;

УстановленныеПараметры.Добавить(ИмяПараметра); //(9)

КонецПроцедуры