Функция ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса) Экспорт //0
	
	ЗаголовокHTTP = Новый Соответствие(); //1
	
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept", "application/json");
	
	УспешныйЗапрос = Истина; //2
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовокHTTP); //3
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	Попытка
		
		Соединение = Новый HTTPСоединение(Сервер,,,,,60); //4
		
		HTTPОтвет = Соединение.Получить(HTTPЗапрос); //5
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); //6
		
		УспешныйЗапрос = Ложь;
		
	КонецПопытки;
	
	ВозвращаемоеЗначение = Новый Структура; //7
	ВозвращаемоеЗначение.Вставить("HTTPМетод",                     "GET");
	ВозвращаемоеЗначение.Вставить("HTTPЗапрос",                    HTTPЗапрос);
	ВозвращаемоеЗначение.Вставить("HTTPОтвет",                     HTTPОтвет);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                   ТекстОшибки);
	ВозвращаемоеЗначение.Вставить("УспешныйЗапрос",                УспешныйЗапрос);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции