
//Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
//    
//    СтандартнаяОбработка = Ложь;
//    
//    СписокДоступныхЗначений = Новый СписокЗначений;
//    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника"));
//    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратПоставщика"));
//    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя"));
//    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке"));
//    
//    ДанныеВыбора = СписокДоступныхЗначений;
//    
//КонецПроцедуры