Процедура РассчитатьСуммуНачисления() Экспорт
	ДнейБольничногоЗаСчетРаботодателя = 3;
	Для Каждого Движение Из ЭтотОбъект Цикл
		
		Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда
			Оклад = Движение.ПоказательРасчета;
			ОтработаноЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
			НормаЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов"); 
			РезультатРасчета = Оклад * ОтработаноЧасов / НормаЧасов; 
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
			Оклад = Движение.ПоказательРасчета;
			СтоимостьДняПоБолезни = Оклад * 24 / 730;
			КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец)+1 - Движение.ПериодДействияНачало)/86400;
			Если КоличествоДнейБолезни <= ДнейБольничногоЗаСчетРаботодателя Тогда
				РезультатРасчета = КоличествоДнейБолезни * СтоимостьДняПоБолезни;
				ДнейБольничногоЗаСчетРаботодателя = ДнейБольничногоЗаСчетРаботодателя - КоличествоДнейБолезни;
			Иначе 
				РезультатРасчета = ДнейБольничногоЗаСчетРаботодателя * СтоимостьДняПоБолезни;
				ДнейБольничногоЗаСчетРаботодателя = 0;
			КонецЕсли;
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);
		ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда           
			РезультатРасчета = Неопределено;
			ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;    
			Выполнить(ФормулаРасчета);
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);
		Иначе
			Движение.Сумма = 0;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон("Для вида расчета %1 не задана формула расчета!", Движение.ВидРасчета);
			СообщениеПользователю.Сообщить();
		КонецЕсли;    
	КонецЦикла;	 
КонецПроцедуры