
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
	 АвтоНаименованиеФИО();
	 КонецЕсли;
 КонецПроцедуры  
 
 &НаКлиенте
 Процедура АвтоНаименованиеФИО()
			 Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	 КонецПроцедуры


&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	АвтоНаименованиеФИО();
КонецПроцедуры


&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	АвтоНаименованиеФИО();
КонецПроцедуры


&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	АвтоНаименованиеФИО();
КонецПроцедуры

