
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыДокумента()
Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма"); 
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчетСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчетСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
    СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Номенклатура);
	СтрокаТЧ.Стоимость = РаботаСЦенамиСервер.ПолучитьЦенуКонтрагентаНаДату(СтрокаТЧ.Номенклатура,Объект.Поставщик,Объект.ВходящаяДата);
	Иначе
		СтрокаТЧ.Стоимость = 0;
КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатьюЗатратПоНоменклатуре(Номенклатура)
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Ссылка", Номенклатура);
Запрос.Текст=
"ВЫБРАТЬ
|    Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
|ИЗ
|    Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|    Номенклатура.Ссылка = &Ссылка";
Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
возврат Выборка.СтатьяЗатрат;
КонецФункции

//&НаСервере
//Процедура ОбновитьЦеныНаСервере()
//	Для сч = 0 По Объект.Услуги.Количество() - 1 Цикл
//		Объект.Услуги[сч].Стоимость = РаботаСЦенамиСервер.ПолучитьЦенуКонтрагентаНаДату(Объект.Услуги[сч].Номенклатура,Объект.Поставщик,Объект.ВходящаяДата);
//	КонецЦикла;	
//КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	//ОбновитьЦеныНаСервере();   
	Для каждого Строка из Объект.Услуги Цикл
		Строка.Стоимость = РаботаСЦенамиСервер.ПолучитьЦенуКонтрагентаНаДату(Строка.Номенклатура, Объект.Поставщик, Объект.ВходящаяДата);
	КонецЦикла;
	
КонецПроцедуры
