
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьТипуОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТипуОрганизации()
	Если Объект.ТипОрганизации = ПредопределенноеЗначение ("Перечисление.ТипыОрганизации.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимостьТипуОрганизации();
КонецПроцедуры

